
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьФайлНастроек(Команда)
	
	ИмяФайлаВыгрузки = СформироватьФайлНастроекНаСервере();
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок      = НСтр("ru = 'Укажите имя файла настроек сравнения/объединения'");
	Диалог.Расширение     = "xml";
	Диалог.ПредварительныйПросмотр = Ложь;
	Диалог.ПолноеИмяФайла = НСтр("ru = 'ФайлНастроекСравнения'");
	Диалог.Фильтр = НСтр("ru = 'Файл настроек сравнения/объединения (*.xml)|*.xml'");
	Если Диалог.Выбрать() Тогда
		КопироватьФайл(ИмяФайлаВыгрузки, Диалог.ПолноеИмяФайла);
		УдалитьФайлы(ИмяФайлаВыгрузки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаИсправительнуюВерсию(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок      = НСтр("ru = 'Укажите файл новой версии БСП'");
	Диалог.Расширение     = "cf";
		Диалог.ПредварительныйПросмотр = Ложь;
		Диалог.ПолноеИмяФайла = НСтр("ru = '1Cv8'");
		Диалог.Фильтр = НСтр("ru = 'Конфигурация информационной базы 1С:Предприятия 8 (*.cf)|*.cf'");
		Если Диалог.Выбрать() Тогда
			ПутьКФайлуОбновления = Диалог.ПолноеИмяФайла;
		КонецЕсли;
	
	ОбновитьНаИсправительнуюВерсиюНаСервере(ПутьКФайлуОбновления);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьФайлНастроекНаСервере()
	ИмяФайлаВыгрузки = ПолучитьИмяВременногоФайла("xml");
	РеквизитФормыВЗначение("Объект").СформироватьФайлНастроекСравненияОбъединения(ИмяФайлаВыгрузки);
	Возврат ИмяФайлаВыгрузки;
КонецФункции

&НаСервере
Процедура ОбновитьНаИсправительнуюВерсиюНаСервере(ПутьКФайлуОбновления)
	Если Не ЗначениеЗаполнено(ПутьКФайлуОбновления) Тогда
		Возврат;
	КонецЕсли;
	РеквизитФормыВЗначение("Объект").ОбновитьНаИсправительнуюВерсию(ПутьКФайлуОбновления);
КонецПроцедуры

#КонецОбласти