#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("СделатьОсновнымЗавершение", ЭтотОбъект, ПараметрКоманды);
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Отметить проект %1 как основной?
		|Основной проект подсвечивается жирным шрифтом и выводится в заголовке программы.'"), Строка(ПараметрКоманды));
	ПоказатьВопрос(ОповещениеОЗакрытии, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СделатьОсновнымЗавершение(Результат, Проект)
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОсновнойПроект(Проект);
	Оповестить("Запись__ДемоПроект", Новый Структура, Проект);
	ОбновитьПовторноИспользуемыеЗначения();
	СтандартныеПодсистемыКлиент.УстановитьРасширенныйЗаголовокПриложения();
		
КонецПроцедуры

&НаСервере
Процедура УстановитьОсновнойПроект(Проект)
	
	Справочники._ДемоПроекты.УстановитьОсновнойПроект(Проект);
		
КонецПроцедуры

#КонецОбласти
