#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВызовОнлайнПоддержки
	Если ПравоДоступа("Просмотр", Метаданные.ОбщиеКоманды.СвязатьсяСоСпециалистомОнлайнПоддержки) Тогда
		ВызовОнлайнПоддержки.ПриСозданииНаСервере(Элементы.ОбщаяКомандаЗапуститьОнлайнПоддержку);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВызовОнлайнПоддержки
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	// СтандартныеПодсистемы.ВызовОнлайнПоддержки
	Если Элементы.Найти("ОбщаяКомандаЗапуститьОнлайнПоддержку") <> Неопределено Тогда
		ВызовОнлайнПоддержкиКлиент.ОбработкаОповещения(ИмяСобытия, Элементы.ОбщаяКомандаЗапуститьОнлайнПоддержку);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВызовОнлайнПоддержки
	
КонецПроцедуры

#КонецОбласти



