#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитФормыВЗначение("Объект").НастройкиПоУмолчанию());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПускСКонтролем(Команда)
	ПроверятьЗаполнение = Истина;
	ПускНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПускБезКонтроля(Команда)
	ПроверятьЗаполнение = Ложь;
	ПускНаКлиенте();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПускНаКлиенте()
	
	ПускНаСервере();
	
	ОповеститьОбИзменении(Тип("СправочникСсылка._ДемоНоменклатура"));
	Если РегистрыСведенийИспользование Тогда
		ОповеститьОбИзменении(Тип("СправочникСсылка._ДемоОрганизации"));
		ОповеститьОбИзменении(Тип("СправочникСсылка._ДемоПодразделения"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.Пользователи"));
	КонецЕсли;
	
	Если ПростыеДублиИспользование Или РегистрыНакопленияИспользование Тогда
		ПараметрыФормы = Новый Структура("ОбластьПоискаДублей", "Справочник._ДемоНоменклатура");
		ОткрытьФорму("Обработка.ПоискИУдалениеДублей.Форма.ПоискДублей", ПараметрыФормы, , Истина, , , , РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
	Если РегистрыСведенийИспользование Тогда
		ПараметрыФормы = Новый Структура("ОбластьПоискаДублей", "Справочник._ДемоФизическиеЛица");
		ОткрытьФорму("Обработка.ПоискИУдалениеДублей.Форма.ПоискДублей", ПараметрыФормы, , Истина, , , , РежимОткрытияОкнаФормы.Независимый);
		
		ПараметрыФормы = Новый Структура("ОбластьПоискаДублей", "Справочник.Пользователи");
		ОткрытьФорму("Обработка.ПоискИУдалениеДублей.Форма.ПоискДублей", ПараметрыФормы, , Истина, , , , РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПускНаСервере()
	РеквизитФормыВЗначение("Объект").Сгенерировать(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти
