#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////////////////////////////////////////////
// Обработчики событий подписок для документов "_Демо".

Процедура _ДемоЗаполнитьДатуДокументаПоРабочейДатеОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	Источник.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура _ДемоЗаполнитьДатуДокументаПоРабочейДатеПриКопировании(Источник, ОбъектКопирования) Экспорт
	
	Источник.Дата = ОбщегоНазначения.ТекущаяДатаПользователя();

КонецПроцедуры

Процедура _ДемоОбновитьРеестрСкладскихДокументовПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений._ДемоРеестрСкладскихДокументов.ОбновитьРеестрСкладскихДокументов(Источник);
	
КонецПроцедуры

#КонецОбласти
