#Область СлужебныеПроцедурыИФункции

// Возвращает результат проверки печати непроведенного документа.
Функция ПечатьРазрешена(СсылкаНаДокумент) Экспорт
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Проведен") Тогда
		Возврат
			НСтр("ru = 'Печать всех проведенных документов разрешена.
			           |Для проверки выберите непроведенный документ.'")
	КонецЕсли;
	
	Если УправлениеДоступом.ЕстьРоль("_ДемоПечатьНепроведенныхДокументов", СсылкаНаДокумент) Тогда
		Возврат
			НСтр("ru = 'Печать этого непроведенного документа разрешена, поскольку документ
			           |доступен на чтение (с учетом ограничения на уровне записей) и
			           |в профиль включена роль ""Демо: Печать непроведенных документов"".'");
	Иначе
		Возврат
			НСтр("ru = 'Печать этого непроведенного документа запрещена, поскольку либо документ
				       |не доступен на чтение (с учетом ограничения на уровне записей), либо
				       |в профиль не включена роль ""Демо: Печать непроведенных документов"".'");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

