#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Загружает настройки пользователей информационной базы.
//
// Параметры:
//	Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//		контейнера, используемый в процессе выгрузи данных. Подробнее см. комментарий
//		к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.
//
Процедура ЗагрузитьНастройкиПользователейИнформационнойБазы(Контейнер, Обработчики) Экспорт
	
	ТипыХранилищ = ВыгрузкаЗагрузкаДанныхСлужебный.ТипыСтандартныхХранилищНастроек();
	
	Для Каждого ТипХранилища Из ТипыХранилищ Цикл
		
		МенеджерЗагрузки = Создать();
		МенеджерЗагрузки.Инициализировать(Контейнер, ТипХранилища, Обработчики);
		МенеджерЗагрузки.ЗагрузитьДанные();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
