#Область ПрограммныйИнтерфейс

// Обработчик клиентской назначаемой команды.
//
// Параметры:
//   ИдентификаторКоманды - Строка - Имя команды, как оно задано в функции СведенияОВнешнейОбработке модуля объекта.
//   МассивДокументов - Массив - Ссылки, для которых выполняется команда.
//
&НаКлиенте
Процедура Печать(ИдентификаторКоманды, МассивДокументов) Экспорт
	
	Если МассивДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Состояние(НСтр("ru = 'Формирование печатных форм...'"));
	
	ИмяМакета = "СписаниеТоваровMSWord";
	МассивИменМакетов = Новый Массив;
	МассивИменМакетов.Добавить(ИмяМакета);
	
	МакетИДанныеОбъекта = ПолучитьМакетИДанныеОбъекта(МассивДокументов, МассивИменМакетов);
	_ДемоСтандартныеПодсистемыКлиент.ПечатьСписаниеТоваров(МакетИДанныеОбъекта, ИмяМакета, МассивДокументов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ОбъектыНазначения") Тогда
		Для Каждого Ссылка Из Параметры.ОбъектыНазначения Цикл
			ОбъектыНазначения.Добавить(Ссылка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьПечатнуюФорму(Команда)
	
	Печать("СписаниеТоваровMSWord", ОбъектыНазначения.ВыгрузитьЗначения());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьМакетИДанныеОбъекта(МассивДокументов, МассивИменМакетов)
	
	МакетыИДанные = Обработки._ДемоПечатнаяФорма.ПолучитьДанныеПечати(МассивДокументов, МассивИменМакетов);
	
	Возврат МакетыИДанные;
	
КонецФункции

#КонецОбласти
