#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ИспользованиеВозможно() Тогда
		ТекстПредупреждения = НСтр("ru = 'Форма недоступна, не включена подсистема ""Анкетирование"".'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
		Возврат;
	КонецЕсли; 
	
	АнкетированиеКлиент.НачатьИнтервью(ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИспользованиеВозможно()
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьАнкетирование");
	
КонецФункции

#КонецОбласти
