
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Макет = ПланыОбмена._ДемоОбменСБиблиотекойСтандартныхПодсистем225.ПолучитьМакет("ПодробнаяИнформация");
	ПолеHTMLДокумента = Макет.ПолучитьТекст();
	Заголовок = НСтр("ru = 'Информация о синхронизации данных с 1С:Библиотека стандартных подсистем, версия 2.2.5'");

КонецПроцедуры

#КонецОбласти