////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сервис криптографии (служебный)".
//  
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

Функция Зашифровать(Знач Данные, Знач Получатели, Знач ТипШифрования, Знач ПараметрыШифрования) Экспорт
	
	Возврат СервисКриптографии.Зашифровать(Данные, Получатели, ТипШифрования, ПараметрыШифрования);
	
КонецФункции

Функция Расшифровать(Знач ЗашифрованныеДанные, Знач Сертификат, Знач ТипШифрования, Знач ПараметрыШифрования) Экспорт
	
	Возврат СервисКриптографии.Расшифровать(ЗашифрованныеДанные, Сертификат, ТипШифрования, ПараметрыШифрования);
	
КонецФункции

Функция Подписать(Знач Данные, Знач Подписант, Знач ТипПодписи, Знач ПараметрыПодписания) Экспорт
	
	Возврат СервисКриптографии.Подписать(Данные, Подписант, ТипПодписи, ПараметрыПодписания);
	
КонецФункции

Функция ПроверитьПодпись(Знач Подпись, Знач Данные, Знач ТипПодписи, Знач ПараметрыПодписания) Экспорт
	
	Возврат СервисКриптографии.ПроверитьПодпись(Подпись, Данные, ТипПодписи, ПараметрыПодписания);
	
КонецФункции

Функция ПроверитьСертификат(Знач Сертификат) Экспорт
	
	Возврат СервисКриптографии.ПроверитьСертификат(Сертификат);
	
КонецФункции

Функция ПолучитьСвойстваСертификата(Знач Сертификат) Экспорт
	
	Возврат СервисКриптографии.ПолучитьСвойстваСертификата(Сертификат);
	
КонецФункции

Функция ПолучитьСертификатыИзПодписи(Знач Подпись) Экспорт
	
	Возврат СервисКриптографии.ПолучитьСертификатыИзПодписи(Подпись);
	
КонецФункции

Функция ПолучитьСвойстваКриптосообщения(Знач Криптосообщение, Знач ТолькоКлючевыеСвойства) Экспорт
	
	Возврат СервисКриптографии.ПолучитьСвойстваКриптосообщения(Криптосообщение, ТолькоКлючевыеСвойства);
	
КонецФункции

Функция ХешированиеДанных(Знач Данные, Знач АлгоритмХеширования, Знач ПараметрыХеширования) Экспорт
	
	Возврат СервисКриптографии.ХешированиеДанных(Данные, АлгоритмХеширования, ПараметрыХеширования);
	
КонецФункции

#КонецОбласти